In [2]:
# Creating a Dummy Dataset
data = {
    'Emp_ID':[*range(101,111)],
    'Emp_Name':['Raj','Rahul','Mahi','Mohan','Anu','Riya','Priya','Anuj','Ram','Shyam'],
    'Emp_Sal':[34456,78665,74635,79876,23456,75635,23476,57377,47557,65435],
    'Emp_Add':['Noida','Delhi','GZB','Hapur','Noida','Delhi','GZB','Hapur','Noida','Delhi']
}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj    34456   Noida
1     102    Rahul    78665   Delhi
2     103     Mahi    74635     GZB
3     104    Mohan    79876   Hapur
4     105      Anu    23456   Noida
5     106     Riya    75635   Delhi
6     107    Priya    23476     GZB
7     108     Anuj    57377   Hapur
8     109      Ram    47557   Noida
9     110    Shyam    65435   Delhi

In [7]:
df.head()

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj    34456   Noida
1     102    Rahul    78665   Delhi
2     103     Mahi    74635     GZB
3     104    Mohan    79876   Hapur
4     105      Anu    23456   Noida

In [9]:
df.head(2)

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj    34456   Noida
1     102    Rahul    78665   Delhi

In [10]:
df.tail()

   Emp_ID Emp_Name  Emp_Sal Emp_Add
5     106     Riya    75635   Delhi
6     107    Priya    23476     GZB
7     108     Anuj    57377   Hapur
8     109      Ram    47557   Noida
9     110    Shyam    65435   Delhi

In [11]:
df.tail(2)

   Emp_ID Emp_Name  Emp_Sal Emp_Add
8     109      Ram    47557   Noida
9     110    Shyam    65435   Delhi

In [12]:
df.columns

Index(['Emp_ID', 'Emp_Name', 'Emp_Sal', 'Emp_Add'], dtype='object')

In [14]:
for col in df.columns:
    print(col)

Emp_ID
Emp_Name
Emp_Sal
Emp_Add

In [15]:
df.Emp_ID

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: Emp_ID, dtype: int64

In [17]:
df['Emp_Name']

0      Raj
1    Rahul
2     Mahi
3    Mohan
4      Anu
5     Riya
6    Priya
7     Anuj
8      Ram
9    Shyam
Name: Emp_Name, dtype: object

In [19]:
print("Total Salary : ",df.Emp_Sal.sum())

Total Salary :  560568

In [20]:
print("Average Salary : ",df.Emp_Sal.sum()/len(df))

Average Salary :  56056.8

In [22]:
# Most Repeating Value
df['Emp_Add'].mode()

0    Delhi
1    Noida
Name: Emp_Add, dtype: object

In [24]:
# mean => Average
print("Average Salary : ",df.Emp_Sal.mean())

Average Salary :  56056.8

In [25]:
# median => (middle Value)
print("Middle Salary : ",df.Emp_Sal.median())

Middle Salary :  61406.0

In [29]:
sorted(df.Emp_Sal)

[23456, 23476, 34456, 47557, 57377, 65435, 74635, 75635, 78665, 79876]

In [32]:
# Median if number of value are in even 
(57377+65435)/2

61406.0

In [33]:
# standard (stv)
df.Emp_Sal.std()

np.float64(22508.753456772716)

In [34]:
# mean => Average
print("Average Salary : ",df.Emp_Sal.mean())

Average Salary :  56056.8

In [35]:
import numpy as np

In [61]:
# Creating a Dummy Dataset
data = {
    'Emp_ID':[*range(101,111)],
    'Emp_Name':['Raj','Rahul','Mahi','Mohan','Anu','Riya',np.nan,'Anuj','Ram','Shyam'],
    'Emp_Sal':[34456,78665,74635,np.nan,23456,75635,23476,np.nan,47557,65435],
    'Emp_Add':['Noida',np.nan,'GZB','Hapur','Noida','Delhi','GZB','Hapur','Noida','Delhi']
}

In [62]:
df = pd.DataFrame(data)

In [38]:
df

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj  34456.0   Noida
1     102    Rahul  78665.0     NaN
2     103     Mahi  74635.0     GZB
3     104    Mohan      NaN   Hapur
4     105      Anu  23456.0   Noida
5     106     Riya  75635.0   Delhi
6     107      NaN  23476.0     GZB
7     108     Anuj      NaN   Hapur
8     109      Ram  47557.0   Noida
9     110    Shyam  65435.0   Delhi

In [40]:
# Finding Null Values in Dataset
df.isnull()

   Emp_ID  Emp_Name  Emp_Sal  Emp_Add
0   False     False    False    False
1   False     False    False     True
2   False     False    False    False
3   False     False     True    False
4   False     False    False    False
5   False     False    False    False
6   False      True    False    False
7   False     False     True    False
8   False     False    False    False
9   False     False    False    False

In [42]:
# total null values by column names
df.isnull().sum()

Emp_ID      0
Emp_Name    1
Emp_Sal     2
Emp_Add     1
dtype: int64

In [43]:
# total null values in a dataset
df.isnull().sum().sum()

np.int64(4)

In [48]:
# Shape of the dataset (rows,columns)
print("Shape " ,df.shape)
print("Total Rows :",df.shape[0])
print("Total Data Points :",df.shape[0]*df.shape[1])

Shape  (10, 4)
Total Rows : 10
Total Data Points : 40

In [54]:
# Missing %age of data in dataset (in terms of datapoints)
print("Missing Data %Age :",df.isnull().sum().sum()/(df.shape[1]*df.shape[0])*100,"%")

Missing Data %Age : 10.0 %

In [55]:
df.head(3)

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj  34456.0   Noida
1     102    Rahul  78665.0     NaN
2     103     Mahi  74635.0     GZB

In [56]:
# Missing %age of data in dataset (in terms of rows)
print("Missing Data %Age :",df.isnull().sum().sum()/(df.shape[0])*100,"%")

Missing Data %Age : 40.0 %

In [59]:
# Remove Null Values from dataset
df = df.dropna()

In [60]:
df

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj  34456.0   Noida
2     103     Mahi  74635.0     GZB
4     105      Anu  23456.0   Noida
5     106     Riya  75635.0   Delhi
8     109      Ram  47557.0   Noida
9     110    Shyam  65435.0   Delhi

In [64]:
df

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj  34456.0   Noida
1     102    Rahul  78665.0     NaN
2     103     Mahi  74635.0     GZB
3     104    Mohan      NaN   Hapur
4     105      Anu  23456.0   Noida
5     106     Riya  75635.0   Delhi
6     107      NaN  23476.0     GZB
7     108     Anuj      NaN   Hapur
8     109      Ram  47557.0   Noida
9     110    Shyam  65435.0   Delhi

In [65]:
df.dropna(inplace=True)

In [66]:
df

   Emp_ID Emp_Name  Emp_Sal Emp_Add
0     101      Raj  34456.0   Noida
2     103     Mahi  74635.0     GZB
4     105      Anu  23456.0   Noida
5     106     Riya  75635.0   Delhi
8     109      Ram  47557.0   Noida
9     110    Shyam  65435.0   Delhi